cfg/Catalogs/ДолжностиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДолжностиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АУП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шахтеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКП</Name>
					<Comment>Наименование по классификатору профессий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗКППТР</Name>
					<Comment>Код ЗКППТР</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/ДолжностиОрганизаций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УстановитьКнопкиПечати();

КонецПроцедуры

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

Процедура КодКПНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Макет = Справочники.ДолжностиОрганизаций.ПолучитьМакет("КлассификаторПрофессийИДолжностей");
	
	СписокСоответствия = Новый СписокЗначений();
		
	ТекущаяСтрока = 0;
	ТЗ = Макет.ТекущаяОбласть;
	Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
		ТЗ = Макет.НайтиТекст(СокрЛП(Наименование), ТЗ,,,,,Истина);		
		Если ТЗ = Неопределено Тогда
			Прервать;
		КонецЕсли;                 
				
		СтрокаКод = "R" + Формат(ТЗ.Верх,"ЧГ=0")+"C2";
		СтрокаДолжность = "R" +  Формат(ТЗ.Верх,"ЧГ=0")+"C6";
		СписокСоответствия.Добавить(СокрЛП((Макет.Область(СтрокаКод).Текст) + " " + СокрЛП(Макет.Область(СтрокаДолжность).Текст)));
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	ЭлементСписка = ВыбратьИзСписка(СписокСоответствия, Элемент);
	
	Если ЭлементСписка <> Неопределено Тогда
		ДлинаКодаКП = Найти(ЭлементСписка.Значение, " ")-1;
		Элемент.Значение = СокрЛП(Лев(ЭлементСписка.Значение,ДлинаКодаКП));
		УстановитьКатегорию();
		ЗначениеКодаКП = СокрЛП(Лев(ЭлементСписка.Значение,ДлинаКодаКП));
		ЗначениеНаименованияПоКП = СокрЛП(Прав(ЭлементСписка.Значение,СтрДлина(ЭлементСписка.Значение)-ДлинаКодаКП));
		ЭтаФорма.ЭлементыФормы.НаименованиеПоКП.Значение = ЗначениеНаименованияПоКП;
		ТекущаяСтрока = 0;
		Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
			ТЗ = Макет.НайтиТекст(ЗначениеКодаКП, ТЗ,,,,,Истина);
			Если ТЗ = Неопределено Тогда
				Прервать;
			КонецЕсли;                 
			СтрокаНаименованиеПоКП = "R" +  Формат(ТЗ.Верх,"ЧГ=0")+"C6";
			СтрокаКодЗКППТР = "R" +  Формат(ТЗ.Верх,"ЧГ=0")+"C3";
			Если СокрЛП(Макет.Область(СтрокаНаименованиеПоКП).Текст) = ЗначениеНаименованияПоКП Тогда
				ЭтаФорма.ЭлементыФормы.КодЗКППТР.Значение = СокрЛП(Макет.Область(СтрокаКодЗКППТР).Текст);
				Прервать;
			Иначе
				Продолжить
			КонецЕсли;	
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура КодКППриИзменении(Элемент)
	
	УстановитьКатегорию();
	
КонецПроцедуры

Процедура УстановитьКатегорию() Экспорт
	
	Если (НЕ ЭтоНовый() И ЗначениеЗаполнено(Категория)) ИЛИ КодКП = "" Тогда
		Возврат;
	КонецЕсли;
	
	КодКп1 = Лев(КодКП,1);
	
	Если КодКп1="1" Тогда
		Категория = Справочники.КатегорииДолжностей.Руководители;
	ИначеЕсли КодКп1="2" Тогда
		Категория = Справочники.КатегорииДолжностей.Профессионалы;
	ИначеЕсли КодКп1="3" Тогда
		Категория = Справочники.КатегорииДолжностей.Специалисты;
	ИначеЕсли КодКп1="4" Тогда
		Категория = Справочники.КатегорииДолжностей.ТехническиеСлужащие;
	ИначеЕсли КодКп1="5" Тогда
		Категория = Справочники.КатегорииДолжностей.РаботникиСферыТорговлиИУслуг;
	ИначеЕсли КодКп1="6" Тогда
		Категория = Справочники.КатегорииДолжностей.КвалифицированныеРаботникиСХ;
	ИначеЕсли КодКп1="7" Тогда
		Категория = Справочники.КатегорииДолжностей.КвалифицированныеРаботникиСИнструментом;
	ИначеЕсли КодКп1="8" Тогда
		Категория = Справочники.КатегорииДолжностей.Рабочие;
	ИначеЕсли КодКп1="9" Тогда
		Категория = Справочники.КатегорииДолжностей.ДругиеСлужащие;	
	КонецЕсли;	
		
	
КонецПроцедуры	
	



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура выполняет открытие формы работы со свойствами документа
//
Процедура ДействияФормыДействиеОткрытьСвойства(Кнопка)

	РаботаСДиалогами.ОткрытьСвойстваДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры // ДействияФормыДействиеОткрытьСвойства()

// Процедура выполняет открытие формы работы с категориями документа
//
Процедура ДействияФормыДействиеОткрытьКатегории(Кнопка)

	РаботаСДиалогами.ОткрытьКатегорииДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры // ДействияФормыДействиеОткрытьКатегории()


Процедура ОсновныеДействияФормыПечатьПоУмолчанию(Кнопка)
	
	УниверсальныеМеханизмы.НапечататьДокументПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку "Печать"
Процедура ОсновныеДействияФормыПечать(Кнопка)
	
	УниверсальныеМеханизмы.ОткрытьФормуВыбораПечатныхФормОбъекта(ЭтотОбъект, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает подменю "Печать" и кнопку "Печать по умолчанию" при необходимости
//
Процедура УстановитьКнопкиПечати()
	
	ФормированиеПечатныхФорм.СоздатьКнопкиПечати(ЭтотОбъект, ЭтаФорма);	
	
КонецПроцедуры // УстановитьКнопкиПечати
